app/Http/Controllers/DashboardController.php

select * from `users` where `users`.`id` = 1 limit 1
---
    public function index(){
        $user = Auth::user()->id;
        $verify = User::find($user);