app/Http/Controllers/FoodsController.php

    public function index()
    {
        $user_id = Auth::user()->id;

        $foods = Foods::where('user_id',$user_id)->orderBy('id','desc')->get();
---
select * from `foods` where `user_id` = 1 order by `id` desc