app/Http/Controllers/OrdersController.php

select * from `orders` order by `id` desc
---
    public function index(){
        $orders = Orders::orderBy('id','desc')->get();

select * from `foods` where `foods`.`id` = 7 limit 1
insert into `orders` (`table_id`, `summa`, `year`, `month`, `day`, `user_id`, `updated_at`, `created_at`) values ('1', 35000, '2024', '01', '20', 1, '2024-01-20 16:19:54', '2024-01-20 16:19:54')
---
    public function store(Request $request,$table){
        $session = $request->session()->get($table);
        //
        $summa = 0;
        foreach($session as $s){
            foreach($s as $food => $count){
                $food = Foods::find($food);
                $summa = $summa + ($food->price * $count);
            }
        }
        //
        $date = date('Y-m-d');
        $date = explode('-',$date);
        // dd($date);
        $store = Orders::create([
            'table_id'=>$table,
            'summa' => $summa,
            'year' =>$date[0],
            'month' => $date[1],
            'day' => $date[2],
            'user_id' => Auth::user()->id
        ]);
        $id = $store->id;
        // dd($session);
        foreach($session as $session){
            foreach($session as $food => $count){
                $food = Foods::find($food);

insert into `order_food` (`food_name`, `food_price`, `food_count`, `order_id`, `updated_at`, `created_at`) values ('Somsa', 15000, '1', 3, '2024-01-20 16:19:54', '2024-01-20 16:19:54')
---
                    'food_count' => $count,
                    'order_id' => $id
                ];
                $store = OrderFood::create($array);