app/Http/Controllers/ServiceController.php

select * from `tables` where `user_id` = 1
---
    public function index(){

        $tables = Tables::where('user_id',$this->user_id())->get();

select * from `foods` where `user_id` = 1
---
    public function create($id){
        $foods = Foods::where('user_id',$this->user_id())->get();

select * from `foods` where `user_id` = 1
---
    public function plus(Request $request,$table){
        $foods = Foods::where('user_id',$this->user_id())->get()->toArray();

select * from `foods` where `foods`.`id` = 3 limit 1
---
    public function show(Request $request,$table){
        // $request->session()->forget($table);
        // dd($table);
        $session = $request->session();
        $data = $session->get($table);
        // dd($data);
        $newdata = [];
        if($data == null){
            return redirect()->back();
        }
        foreach($data as $data){
            foreach($data as $food => $count){
                $new_food = Foods::find($food);