app/Http/Controllers/TablesController.php

    public function index()
    {
        $user_id = Auth::user()->id;
        $tables = Tables::where('user_id',$user_id)->orderBy('id','desc')->get();
---
select * from `tables` where `user_id` = 1 order by `id` desc