app/Http/Controllers/UserController.php

    public function index(){
        $user_id = Auth::user()->id;
        $user = User::find($user_id);
---
select * from `users` where `users`.`id` = 1 limit 1

    public function update(Request $request,$id){
        // dd($request);
        $user = User::find($id);
        if($user){
            $update = $user->update([
                "name" => $request->name,
                "description" => $request->description,
                "company" => $request->company,
                "country" => $request->country,
                "address" => $request->address,
                "phone" => $request->phone
            ]);
---
select * from `users` where `users`.`id` = '1' limit 1